In [5]:
import pandas as pd
index=3

var=['a','b','c','d']
pd.Series(var)

0    a
1    b
2    c
3    d
dtype: object

In [7]:
num=[10,20,30]
var=['a','b','c']
pd.Series(var,index=num)

10    a
20    b
30    c
dtype: object

In [11]:
marks = {
    'maths': 67,
    'english': 57,
    'science': 89,
    'computer': 100
}
marks_series = pd.Series(marks, name="subject")
marks_series

maths        67
english      57
science      89
computer    100
Name: subject, dtype: int64

In [10]:
df=pd.read_csv("data.csv")
print(df.head(4))

  name  age  address profession
0    A   11    earth   engineer
1   A1   13  mercury   frontend
2   A2   13    venus   frontend
3   A3   13    earth    backend

In [12]:
print(df.shape)

(5, 4)

In [14]:
print(df.dtypes)

name          object
age            int64
address       object
profession    object
dtype: object

In [15]:
print(df.describe)

<bound method NDFrame.describe of   name  age   address profession
0    A   11     earth   engineer
1   A1   13   mercury   frontend
2   A2   13     venus   frontend
3   A3   13     earth    backend
4   A4   13  neuptune   frontend>

In [18]:
df["name"] = df["name"].str.upper()
df

  name  age   address profession
0    A   11     earth   engineer
1   A1   13   mercury   frontend
2   A2   13     venus   frontend
3   A3   13     earth    backend
4   A4   13  neuptune   frontend

In [20]:
df.columns=df.columns.str.strip()
df["age"]=(df["age"]-df["age"].mean())/df["age"].std()
df

  name       age   address profession
0    A -1.788854     earth   engineer
1   A1  0.447214   mercury   frontend
2   A2  0.447214     venus   frontend
3   A3  0.447214     earth    backend
4   A4  0.447214  neuptune   frontend